app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE "books"."id" = 4 LIMIT 1
---
  def show
    @user = current_user
    @book=Book.find(params[:id])

SELECT "books".* FROM "books" WHERE "books"."id" = 1 LIMIT 1
DELETE FROM "books" WHERE "books"."id" = 1
---
  def destroy
    current_user
    @book = Book.find(params[:id])
    @book.destroy