app/controllers/haikus_controller.rb

SELECT "haikus".* FROM "haikus" INNER JOIN "users" ON "users"."id" = "haikus"."user_id"
---
  def index
    @current_user = current_user
    #@haikus = Haiku.all
    @haikus = Haiku.joins(:user).all