app/controllers/haikus_controller.rb

SELECT "haikus".* FROM "haikus"
---
  def index
    @current_user = current_user
    @haikus = Haiku.all

SELECT "haikus".* FROM "haikus" WHERE "haikus"."id" = 1 LIMIT 1
---
  def show
    @haiku = Haiku.find(params[:id])

INSERT INTO "haikus" ("title", "sentence", "user_id", "point", "created_at", "updated_at") VALUES ('写真a', 'aaaaaaaaaa', 1, NULL, '2011-10-30 04:29:47.993203', '2011-10-30 04:29:47.993203')
---
  def create
    @current_user = current_user
    @haiku = Haiku.new(params[:haiku])

    respond_to do |format|
      if @haiku.save

SELECT "haikus".* FROM "haikus" WHERE "haikus"."id" = 5 LIMIT 1
DELETE FROM "haikus" WHERE "haikus"."id" = 5
---
  def destroy
    @current_user = current_user
    @haiku = Haiku.find(params[:id])
    @haiku.destroy