app/controllers/my_page_controller.rb

  def index
    @user = current_user
    @my_books=Rails.cache.read('MY_BOOKS')
    if @my_books == nil
      @my_books=Book.where('user_id=?',@user.id).latest.paginate(:page => params[:page], :per_page => 5)
      Rails.cache.write('MY_BOOKS',@my_books)
    end
    @my_schedule=Schedule.where('user_id=?',@user.id).latest.paginate(:page => params[:page], :per_page => 5)
    @my_tasks ||=Task.where('user_id=?',@user.id).latest.paginate(:page=>params[:pgae],:per_page=>5)
---
SELECT "books".* FROM "books" WHERE (user_id=1) ORDER BY updated_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "books" WHERE (title = 'テストTweet Railsスーパーサンプル' and user_id = 1)
SELECT "schedules".* FROM "schedules" WHERE (user_id=1) ORDER BY updated_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "schedules" WHERE (title = '7月2日' and user_id = 1)
SELECT "tasks".* FROM "tasks" WHERE (user_id=1) ORDER BY updated_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "tasks" WHERE (title = ':問い合わせ用ブログをチェックする' and user_id = 1)