app/controllers/secretaries_controller.rb

  def index
    #redirect_to_smt
    current_user
    unless session[:user_id] ==nil
      @secretaries = Secretary.where("user_id =?",session[:user_id]).latest.paginate(:page => params[:page], :per_page => 5)
---
SELECT "secretaries".* FROM "secretaries" WHERE (user_id =1) ORDER BY updated_at desc LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "secretaries" WHERE (user_id =1)

  def show
    @secretary = Secretary.find(params[:id])
    if @secretary.secretary_word_id != nil
      @secretary_word = SecretaryWord.find @secretary.secretary_word_id
---
SELECT "secretaries".* FROM "secretaries" WHERE "secretaries"."id" = 1 LIMIT 1
SELECT "secretary_words".* FROM "secretary_words" WHERE "secretary_words"."id" = 4 LIMIT 1

  def edit
    @secretary = Secretary.find(params[:id])
---
SELECT "secretaries".* FROM "secretaries" WHERE "secretaries"."id" = 3 LIMIT 1

  def create
    @secretary = Secretary.new(params[:secretary])
    @user = current_user
    @secretary.user_id = @user.id
    respond_to do |format|
      if @secretary.save_and_update_word
---
INSERT INTO "secretaries" ("name", "age", "cleverness", "accuracy", "user_id", "created_at", "updated_at", "main_flag", "secretary_word_id") VALUES ('テスト', 11, 0, 1, 1, '2011-06-25 13:22:18.810000', '2011-06-25 13:22:18.810000', 't', NULL)

  def update
    @secretary = Secretary.find(params[:id])
    @user = current_user
    @secretary.user_id = @user.id
    @secretary.main_flag = params[:secretary][:main_flag]
    respond_to do |format|
      if @secretary.update_attributes_and_update_word(params[:secretary])
---
SELECT "secretaries".* FROM "secretaries" WHERE "secretaries"."id" = 3 LIMIT 1
UPDATE "secretaries" SET "secretary_word_id" = 5, "cleverness" = 2, "updated_at" = '2011-06-25 13:53:22.225000' WHERE "secretaries"."id" = 4

  def destroy
    @secretary = Secretary.find(params[:id])
    @secretary.destroy
---
SELECT "secretaries".* FROM "secretaries" WHERE "secretaries"."id" = 2 LIMIT 1
DELETE FROM "secretaries" WHERE "secretaries"."id" = 2