app/controllers/sessions_controller.rb

INSERT INTO "users" ("provider", "uid", "name", "created_at", "updated_at", "image", "token", "secret", "image_path") VALUES ('twitter', '7751092', 's_nakamura', '2011-10-30 04:02:48.049912', '2011-10-30 04:02:48.049912', NULL, '7751092-0WGw7QM1RBLt7nbZtRPHkRBHt5efVrwlq9D31efNri', 'HLfQ7y2U50T7Tf7E7iYBGxF1Z8cAl4IUBcIFIQYNfTs', 'http://a1.twimg.com/profile_images/25995392/dog_normal.jpg')
SELECT "users".* FROM "users" WHERE "users"."provider" = 'provider =? and uid=?' AND "users"."uid" = 'twitter' LIMIT 1
---
  def create
    auth = request.env["omniauth.auth"]
    @user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_with_omniauth(auth)