app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
---
  def show
    @user = current_user
    @task = Task.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
---
  def edit
    @user = current_user
    @task = Task.find(params[:id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
UPDATE "tasks" SET "priority" = 2, "updated_at" = '2011-11-20 02:58:53.477691' WHERE "tasks"."id" = 2
---
  def update
    @user = current_user
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(params[:task])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = 1 LIMIT 1
DELETE FROM "tasks" WHERE "tasks"."id" = 1
---
  def destroy
    @user = current_user
    @task = Task.find(params[:id])
    @task.destroy